;abilities
[RM_Punch X2AbilityTemplate]
LocFriendlyName="拳击"
LocLongDescription="用快拳攻击任何邻近的敌人。"
LocHelpText="用快拳攻击任何邻近的敌人。只使用一个行动点，不结束单位的回合。"
LocPromotionPopupText="<Bullet/>与打击不同，拳击只能攻击单位旁边的目标，而且攻击力较弱。<br/><Bullet/>但是，拳击只使用一个行动点，不会结束单位的回合，并且每回合可以使用多次。<br/><Bullet/>对靠得太近的敌人使用这个。<br/>"


[RMGrimyCloseCombat X2AbilityTemplate]
LocFriendlyName="近距离作战协议"
LocLongDescription="进入周围<Ability:CLOSE_COMBAT_DISTANCE/>格范围内的敌人会触发反应射击。"
LocHelpText="进入周围<Ability:CLOSE_COMBAT_DISTANCE/>格范围内的敌人会触发反应射击。"
LocPromotionPopupText="<Bullet/>进入周围<Ability:CLOSE_COMBAT_DISTANCE/>格范围内的敌人会触发反应射击。<br/>"

[RMGrimyMayhem X2AbilityTemplate]
LocFriendlyName="骚乱"
LocLongDescription="压制造成<Ability:MAYHEM_DMG/>伤害。"
LocHelpText="压制造成<Ability:MAYHEM_DMG/>伤害。"
LocPromotionPopupText="<Bullet/>压制造成<Ability:MAYHEM_DMG/>伤害。<br/>"

[UtilityRigging X2AbilityTemplate]
LocFriendlyName="纳米肌肉纤维"
LocLongDescription="SPARK每次任务开始时获得+<Ability:MUSCLE_MOBILITY/>护盾点。"
LocHelpText="SPARK获得+<Ability:MUSCLE_MOBILITY/>护盾点。"
LocPromotionPopupText="<Bullet/>SPARK在任务中获得+<Ability:MUSCLE_MOBILITY/>护盾点。<br/>"

[PCSAdaptation X2AbilityTemplate]
LocFriendlyName="镜片校准"
LocLongDescription="SPARK获得+<Ability:AIM_POINTS>命中。"
LocHelpText="SPARK获得+<Ability:AIM_POINTS>命中。"
LocPromotionPopupText="<Bullet/>SPARK获得+<Ability:AIM_POINTS>命中。<br/>"

[SPARKShields X2AbilityTemplate]
LocFriendlyName="SPARK护盾"
LocLongDescription="SPARK获得<Ability:SPARK_SHIELD/>点护盾值。"
LocHelpText="SPARK获得<Ability:SPARK_SHIELD/>点护盾值。"
LocPromotionPopupText="<Bullet/>SPARK获得<Ability:SPARK_SHIELD/>点护盾值。<br/>"

[HeavyWeaponStorage X2AbilityTemplate]
LocFriendlyName="重武器储存"
LocLongDescription="SPARK获得额外的+<Ability:HEAVY_STORAGE/>重型武器射击。"
LocHelpText="SPARK获得额外的+<Ability:HEAVY_STORAGE/>重型武器射击。"
LocPromotionPopupText="<Bullet/>SPARK获得额外的+<Ability:HEAVY_STORAGE/>重型武器射击。<br/>"

[AutomatedThreatAssessment X2AbilityTemplate]
LocFriendlyName="自主威胁评估"
LocLongDescription="如果没有攻击，SPARK获得+<Ability:AUTOMATED_THREAT/>防御力。"
LocHelpText="如果没有攻击，SPARK获得+<Ability:AUTOMATED_THREAT/>防御力。"
LocPromotionPopupText="<Bullet/>如果没有攻击，SPARK获得+<Ability:AUTOMATED_THREAT/>防御力。<br/>"

[BerserkerGauntlet X2AbilityTemplate]
LocFriendlyName="狂战士手套"
LocLongDescription="SPARK获得+<Ability:GAUNTLET_DMG/>额外近战伤害。"
LocHelpText="SPARK获得+<Ability:GAUNTLET_DMG/>额外近战伤害。"
LocPromotionPopupText="<Bullet/>SPARK获得+<Ability:GAUNTLET_DMG/>额外近战伤害。<br/>"

[NanomachinesSon X2AbilityTemplate]
LocFriendlyName="自修理纳米微型机器人"
LocLongDescription="SPARK的修理时间减少，如果受到的伤害小于等于<Ability:NANOREPAIR/>，则不需要修理。"
LocHelpText="SPARK的修理时间减少，如果受到的伤害小于等于<Ability:NANOREPAIR/>，则不需要修理。"
LocPromotionPopupText="<Bullet/>SPARK的修理时间减少，如果受到的伤害小于等于<Ability:NANOREPAIR/>，则不需要修理。<br/>"

[HyperReactiveRounds X2AbilityTemplate]
LocFriendlyName="自瞄准弹药"
LocLongDescription="如果射击未命中，则下一次射击命中+<Ability:SELF_AIM/>。"
LocHelpText="如果射击未命中，则下一次射击命中+<Ability:SELF_AIM/>。"
LocPromotionPopupText="<Bullet/>如果射击未命中，则下一次射击命中+<Ability:SELF_AIM/>。<br/>"

[ShieldHardener X2AbilityTemplate]
LocFriendlyName="护盾硬化"
LocLongDescription="受到的伤害最多等于当前的护盾值。"
LocHelpText="受到的伤害最多等于当前的护盾值。"
LocPromotionPopupText="<Bullet/>受到的伤害最多等于当前的护盾值。<br/>"

[NanoweaveBonus X2AbilityTemplate]
LocFriendlyName="纳米底盘"
LocLongDescription="受到伤害后获得+<Ability:NANOWEAVE/>护甲值。"
LocHelpText="受到伤害后获得+<Ability:NANOWEAVE/>护甲值。"
LocPromotionPopupText="<Bullet/>受到伤害后获得+<Ability:NANOWEAVE/>护甲值。<br/>"

[NanoweavePassive X2AbilityTemplate]
LocFriendlyName="纳米底盘"
LocLongDescription="受到伤害后获得+<Ability:NANOWEAVE/>护甲值。"
LocHelpText="受到伤害后获得+<Ability:NANOWEAVE/>护甲值。"
LocPromotionPopupText="<Bullet/>受到伤害后获得+<Ability:NANOWEAVE/>护甲值。<br/>"

[CodexModuleBonus X2AbilityTemplate]
LocFriendlyName="原典模组"
LocLongDescription="每个视野内的敌人提供+<Ability:CODEX_DODGE/>闪避，最多+<Ability:CODEX_MAX/>。"
LocHelpText="每个视野内的敌人提供+<Ability:CODEX_DODGE/>闪避，最多+<Ability:CODEX_MAX/>。"
LocPromotionPopupText="<Bullet/>每个视野内的敌人提供+<Ability:CODEX_DODGE/>闪避，最多+<Ability:CODEX_MAX/>。<br/>"

[RM_Suppression X2AbilityTemplate]
LocFriendlyName="压制"
LocLongDescription="向目标发射密集的弹幕，如果目标移动则会触发反应射击，目标将受到-<Ability:SUPPRESSIONPENALTY/>命中惩罚。"
LocHelpText="降低目标命中并且目标移动会触发反应射击。"
LocFlyOverText="压制"
LocPromotionPopupText="<Bullet/>压制消耗<Ability:SelfAmmoCost/>弹药，但没有冷却时间。<br/><Bullet/>如果受到伤害则会中断压制技能。<br/><Bullet/>多个压制技能造成的命中惩罚会叠加。<br/>"


[SuppressionProtocol X2AbilityTemplate]
LocFriendlyName="压制协议"
LocLongDescription="SPARK能够使用压制技能。"
LocHelpText="SPARK能够使用压制技能。"
LocPromotionPopupText="<Bullet/>SPARK能够使用压制技能。<br/>"

;techs


[SPARKSuppression X2TechTemplate]
DisplayName="SPARK压制"
Summary="我们为SPARK编写了新的程序，使得它们能够在战场上对敌人发射密集的炮火。"

[SPARKPCS X2TechTemplate]
DisplayName="镜片校准"
Summary="我们的科研团队尝试将变种人的芯片系统运用到我们的机械上，SPARK的命中得到了显著提升。"

[SPARKRigging X2TechTemplate]
DisplayName="纳米肌肉纤维"
Summary="这是机械和生物结合的新产物，在试图将肌肉组织的结构糅合进冰冷的钢铁中之后，我们开发出了这种新的材料能够让SPARK的零件更具弹性。"

[SPARKShields X2TechTemplate]
DisplayName="SPARK护盾"
Summary="对变种人护盾科技的研究突破，让我们的SPARK获得了护盾的保护，显著提升了他们在战场上的存活率。"

[SPARKMayhem X2TechTemplate]
DisplayName="骚乱协议"
Summary="得益于对变种人MEC的研究，SPARK的炮火更加密集了。"

[SPARKCloseCombat X2TechTemplate]
DisplayName="近距离作战协议"
Summary="这种搭载在SPARK上的微型感知系统能够在敌人进入警戒范围内时对SPARK发出指令，指挥武器系统自动向周围目标发动进攻。"

[SPARKHeavyWeapon X2TechTemplate]
DisplayName="SPARK重武器储存"
Summary="我们想办法改进了SPARK的机械结构，使得在体积基本没有改变的情况下能够多带一发重武器，这对战场上的支援无疑是巨大的。"

[SPARKATA X2TechTemplate]
DisplayName="自主威胁评估"
Summary="有时候我们并没有完美的机会能向敌人开火，在这个空档中我们开发了一种新的装置，能够在武器系统闲下来的时候来提升SPARK的防御能力。"

[SPARKGauntlet X2TechTemplate]
DisplayName="狂战士手套"
Summary="基于对狂战士的研究，我们开发了一种使用于SPARK的版本，这种装置显著提升了SPARK的肉搏能力。"

[SPARKNanomachines X2TechTemplate]
DisplayName="自修理纳米微型机器人"
Summary="这种比小精灵更加微小的机器人能在SPARK受到伤害时自动维修。如果适当修改和重新编程，我们可以使用这些纳米机器来帮助损坏的SPARK修复的更快。"


[RebuildSPARK X2TechTemplate]
DisplayName="重建SPARK"
Summary="SPARK并不像人类一样，即使在战场上被摧毁了，它的主程序也有人工智能备份。如果给我们技术人员一点时间，我们甚至能重新建造一个和原来一模一样的SPARK，但是需要注意的是，重建后的单位将与原来的单位不完全相同，人工智能将需要一些实地经验来适应新的身体，然后才能再次使用所有的旧技能。"

[RM_ConvertMEC X2TechTemplate]
DisplayName="MEC碎片重利用"
Summary="将MEC碾压成碎片之后，我们能用这些材料建造SPARK，当然还需要一些其他的开销。"

[RM_SparkSergeantTech X2TechTemplate]
DisplayName="高级SPARK建造"
Summary="现在我们有了一批经验丰富的士兵，也有了与变种人MEC接触的经验，使用我们先前任务的作战数据应该能够让我们的SPARK建造有一个更好的基础。这将能够使我们建造出的SPARK一开始就是有经验的单位。"


;items and corpse

[CorpseSPARK X2ItemTemplate]
FriendlyName="破损的SPARK装甲"
FriendlyNamePlural="破损的SPARK装甲"
BriefSummary="破损的SPARK装甲。拿给我们的工程师瞧瞧或许能够建造一个全新的..." 

[SCRounds X2AmmoTemplate]
FriendlyName="自瞄准弹药"
FriendlyNamePlural="自瞄准弹药"
BriefSummary="这些弹药原先是变种人军官的必需品，后来废弃了之后，我们将其运用到了SPARK上。当一个SPARK射击未命中时，自我修正程序将数据发送回火花，以帮助修正目标，提高下一次射击的命中率。"
TacticalText="<Bullet/>如果你的武器射击未命中，则下一次射击命中+<Ability:SELF_AIM/>。"

[Hardener X2EquipmentTemplate]
FriendlyName="护盾硬化"
FriendlyNamePlural="护盾硬化"
BriefSummary="护盾硬化是对SPARK护盾的增强。当单位受到攻击大于护盾的防御力时，护盾仍然会阻挡整个攻击，而不会造成任何伤害。"
TacticalText="<Bullet/>受到的伤害最多等于当前的护盾值。<br/><Bullet/>提供+1护盾值。"

[Nanoweave X2EquipmentTemplate]
FriendlyName="纳米底盘"
FriendlyNamePlural="纳米底盘"
BriefSummary="我们将更先进的底盘加装在了SPARK之上，这种装置能够在SPARK受到攻击的时候开启自动保护系统。"
TacticalText="<Bullet/>单位受到攻击时提供+<Ability:NANOWEAVE/>护甲值。<br/><Bullet/>效果持续到回合结束，单位不再受到任何伤害。"

[CodexModule X2EquipmentTemplate]
FriendlyName="原典模组"
FriendlyNamePlural="原典模组"
BriefSummary="原典是个灵活的不可捉摸的神奇物种，得益于对这种物种的研究，我们开发出了一种扰乱装置，更容易躲开敌人的火力，尤其是面对大量敌人时。"
TacticalText="<Bullet/>视野内每个敌人提供+<Ability:CODEX_DODGE/>闪避加成，最多+<Ability:CODEX_MAX/>。"
